<details><summary>Digger run report at 2024-01-08 14:18:03 (UTC)</summary>
        <details><summary>Plan for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_acm</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network will be updated in-place
  ~ resource "aws_vpc" "vpc_network" {
        id                                   = "vpc-025258e79a93eebc0"
      ~ tags                                 = {
          ~ "Name" = "terraform-network10" -> "terraform-network1"
        }
      ~ tags_all                             = {
          ~ "Name" = "terraform-network10" -> "terraform-network1"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>

<details><summary>Terraform plan validation check (terraform_gp_2134_global_acm)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_ec2</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network_2 will be created
  + resource "aws_vpc" "vpc_network_2" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network2"
        }
      + tags_all                             = {
          + "Name" = "terraform-network2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>


<details><summary>Terraform plan validation check (terraform_gp_2134_global_ec2)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>